In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# Handling Missing Data

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [6]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna() # it drops the complete rows , whs columns include null values

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],[NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned = data.dropna()

In [14]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [15]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [18]:
data.dropna(1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.112949  0.044944 -0.257602
1 -1.032667 -0.904684 -0.183053
2  1.197153  0.358723  1.741048
3 -0.551832 -0.712254  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [21]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.112949       NaN       NaN
1 -1.032667       NaN       NaN
2  1.197153       NaN  1.741048
3 -0.551832       NaN  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [22]:
df.dropna()

          0         1         2
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [23]:
df.dropna(thresh=2)

          0         1         2
2  1.197153       NaN  1.741048
3 -0.551832       NaN  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [24]:
df

          0         1         2
0 -0.112949       NaN       NaN
1 -1.032667       NaN       NaN
2  1.197153       NaN  1.741048
3 -0.551832       NaN  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [25]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
df.fillna(0)

          0         1         2
0 -0.112949  0.000000  0.000000
1 -1.032667  0.000000  0.000000
2  1.197153  0.000000  1.741048
3 -0.551832  0.000000  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [27]:
data.fillna(1)

     0    1    2    4
0  1.0  6.5  3.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0
3  1.0  6.5  3.0  1.0

In [28]:
data.fillna(7)

     0    1    2    4
0  1.0  6.5  3.0  7.0
1  1.0  7.0  7.0  7.0
2  7.0  7.0  7.0  7.0
3  7.0  6.5  3.0  7.0

In [29]:
np.mean(data)

0    1.0
1    6.5
2    3.0
4    NaN
dtype: float64

In [30]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [32]:
print(df)
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.112949       NaN       NaN
1 -1.032667       NaN       NaN
2  1.197153       NaN  1.741048
3 -0.551832       NaN  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

          0         1         2
0 -0.112949  0.500000  0.000000
1 -1.032667  0.500000  0.000000
2  1.197153  0.500000  1.741048
3 -0.551832  0.500000  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [33]:
data.fillna(np.mean(data))

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  6.5  3.0 NaN
3  1.0  6.5  3.0 NaN

In [34]:
df.fillna(0, inplace=True)

In [35]:
df

          0         1         2
0 -0.112949  0.000000  0.000000
1 -1.032667  0.000000  0.000000
2  1.197153  0.000000  1.741048
3 -0.551832  0.000000  1.378798
4  0.843392 -0.149282  0.472107
5  1.291435 -0.303731 -1.813711
6  0.194620 -0.118410  0.681232

In [36]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.138156 -0.359161  0.778360
1 -1.345068  0.429325  0.921464
2  0.678430       NaN -1.009008
3 -0.963475       NaN  0.843705
4  0.105428       NaN       NaN
5 -1.118790       NaN       NaN

In [37]:
df.fillna(method='ffill')

          0         1         2
0  0.138156 -0.359161  0.778360
1 -1.345068  0.429325  0.921464
2  0.678430  0.429325 -1.009008
3 -0.963475  0.429325  0.843705
4  0.105428  0.429325  0.843705
5 -1.118790  0.429325  0.843705

In [38]:
df.fillna(method="ffill", axis=1)

          0         1         2
0  0.138156 -0.359161  0.778360
1 -1.345068  0.429325  0.921464
2  0.678430  0.678430 -1.009008
3 -0.963475 -0.963475  0.843705
4  0.105428  0.105428  0.105428
5 -1.118790 -1.118790 -1.118790

In [39]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.138156 -0.359161  0.778360
1 -1.345068  0.429325  0.921464
2  0.678430  0.429325 -1.009008
3 -0.963475  0.429325  0.843705
4  0.105428       NaN  0.843705
5 -1.118790       NaN  0.843705

In [40]:
data = pd.Series([1., NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [41]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [42]:
df.iloc[:,1]

0   -0.359161
1    0.429325
2         NaN
3         NaN
4         NaN
5         NaN
Name: 1, dtype: float64

# Data Transformation
## Removing Duplicates

In [43]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [44]:
data.dropna()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [47]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [48]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [52]:
data[data.duplicated()]
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [54]:
#dropduplicate base on specific column or columns
data.drop_duplicates(subset='k1')

    k1  k2
0  one   1
1  two   1

In [55]:
data.drop_duplicates(subset='k1', keep= 'last')

    k1  k2
4  one   3
6  two   4

In [56]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

# Transforming Data Using a Function or Mapping

In [57]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [61]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
data['animal'] = data.food.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     NaN
4  corned beef     7.5     cow
5        Bacon     8.0     NaN
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [63]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [64]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [65]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [66]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [67]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [68]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [69]:
 data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [70]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [74]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [75]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [76]:
 data.index = data.index.map(transform)

In [77]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [78]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [79]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [80]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [81]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [82]:
bins = [18, 25, 35, 60, 100]

In [83]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [86]:
 cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [87]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [85]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

In [88]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [89]:
pd.cut(ages, [18, 26, 36, 61, 100], right=True)

[(18, 26], (18, 26], (18, 26], (26, 36], (18, 26], ..., (26, 36], (36, 61], (36, 61], (36, 61], (26, 36]]
Length: 12
Categories (4, interval[int64]): [(18, 26] < (26, 36] < (36, 61] < (61, 100]]

In [90]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.046, 0.28], (0.51, 0.74], (0.28, 0.51], (0.046, 0.28], (0.74, 0.96], ..., (0.74, 0.96], (0.74, 0.96], (0.046, 0.28], (0.046, 0.28], (0.28, 0.51]]
Length: 20
Categories (4, interval[float64]): [(0.046, 0.28] < (0.28, 0.51] < (0.51, 0.74] < (0.74, 0.96]]

In [91]:
pd.cut(data, 4, precision=2).value_counts()

(0.046, 0.28]    6
(0.28, 0.51]     5
(0.51, 0.74]     2
(0.74, 0.96]     7
dtype: int64

In [92]:
data = np.random.randn(1000)
cats = pd.qcut(data, 4)
cats

[(0.676, 2.693], (0.676, 2.693], (-0.678, -0.00293], (-0.678, -0.00293], (-0.678, -0.00293], ..., (-3.903, -0.678], (-0.678, -0.00293], (-0.678, -0.00293], (-0.678, -0.00293], (-3.903, -0.678]]
Length: 1000
Categories (4, interval[float64]): [(-3.903, -0.678] < (-0.678, -0.00293] < (-0.00293, 0.676] < (0.676, 2.693]]

In [95]:
pd.qcut(data,[0, 0.1, 0.5, 0.75, 1])

[(0.676, 2.693], (0.676, 2.693], (-1.31, -0.00293], (-1.31, -0.00293], (-1.31, -0.00293], ..., (-1.31, -0.00293], (-1.31, -0.00293], (-1.31, -0.00293], (-1.31, -0.00293], (-1.31, -0.00293]]
Length: 1000
Categories (4, interval[float64]): [(-3.903, -1.31] < (-1.31, -0.00293] < (-0.00293, 0.676] < (0.676, 2.693]]

In [96]:
pd.qcut(data,[0, 0.1, 0.5, 0.75, 1]).value_counts()

(-3.903, -1.31]      100
(-1.31, -0.00293]    400
(-0.00293, 0.676]    250
(0.676, 2.693]       250
dtype: int64

# Detecting and Filtering Outliers

In [97]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.023476    -0.056691    -0.045004    -0.040097
std       1.022598     1.022336     0.989952     1.033764
min      -3.158864    -3.842057    -3.202160    -3.027423
25%      -0.655590    -0.766716    -0.701911    -0.779909
50%       0.020779    -0.077640    -0.029710    -0.013258
75%       0.666351     0.608344     0.648332     0.680833
max       3.155702     3.197115     2.834769     2.942756

In [99]:
col = data[2]
col

0     -1.682765
1     -1.933256
2      0.657906
3      0.226104
4      0.545886
         ...
995    0.758302
996   -0.336701
997    0.501270
998    0.625570
999   -1.114221
Name: 2, Length: 1000, dtype: float64

In [100]:
col[np.abs(col) > 3]

892   -3.202160
920   -3.125983
Name: 2, dtype: float64

In [101]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
276 -3.158864 -0.696833 -1.966704 -1.351259
407 -3.070643 -0.100063 -1.090839  0.025090
458  2.033571 -3.842057 -0.030259 -0.495803
462  1.239813  3.197115  0.497348  0.271667
549 -0.285160  3.022340  0.610452  0.093039
675 -1.512389  1.159807 -0.307848 -3.027423
693  3.155702 -1.372273 -0.746711 -1.469757
892 -1.295504 -3.001252 -3.202160 -1.663943
920  0.077573  1.148126 -3.125983 -0.933982
932 -0.176608  3.037339  0.286377 -0.048567
969 -0.189905  3.081378  0.560695  0.157143

In [102]:
np.array([True,True,False]).any()

True

In [103]:
np.array([True,True,False]).all()

False

In [104]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [105]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.023550    -0.056186    -0.044676    -0.040070
std       1.021438     1.018516     0.988942     1.033685
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.655590    -0.766716    -0.701911    -0.779909
50%       0.020779    -0.077640    -0.029710    -0.013258
75%       0.666351     0.608344     0.648332     0.680833
max       3.000000     3.000000     2.834769     2.942756

In [106]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1  1.0  1.0 -1.0  1.0
2 -1.0  1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4 -1.0 -1.0  1.0 -1.0

# Permutation and Random Sampling

In [112]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [113]:
sampler = np.random.permutation(5)
sampler

array([0, 3, 1, 2, 4])

In [114]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11
4  16  17  18  19

In [115]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
3  12  13  14  15

In [116]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

4    4
4    4
1    7
3    6
2   -1
1    7
0    5
1    7
1    7
4    4
dtype: int64

In [117]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=3, replace=False)
draws

2   -1
1    7
3    6
dtype: int64

# Computing Indicator/Dummy Variables

In [121]:
a = pd.Series(['A','B','C','A','B','C'])
pd.get_dummies(a)

   A  B  C
0  1  0  0
1  0  1  0
2  0  0  1
3  1  0  0
4  0  1  0
5  0  0  1